In [21]:
import pandas as pd
df = pd.read_csv('Titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

**Make Survived Column as Class LABEL**

In [22]:
inputs = df.drop('Survived',axis='columns')

In [23]:
target = df['Survived']

**Now Convert Column Sex's, cabin, and Embarked Data into Numbers 
Using  Label Encoder**

In [24]:
from sklearn.preprocessing import LabelEncoder
le_Sex = LabelEncoder()
le_Embarked = LabelEncoder()
le_Cabin = LabelEncoder()

**Now, by use fit and transform method**
The fit method is calculating the mean and variance of each of the features present in our data. The transform method is transforming all the features using the respective mean and variance
**Also make new columns for them**

In [25]:
inputs['Sex_n'] = le_Sex.fit_transform(inputs['Sex'])
inputs['Embarked_n'] = le_Sex.fit_transform(inputs['Embarked'])
inputs['Cabin_n'] = le_Sex.fit_transform(inputs['Cabin'])

In [26]:
inputs.head()

   PassengerId  Pclass  ... Embarked_n Cabin_n
0            1       3  ...          2     147
1            2       1  ...          0      81
2            3       3  ...          2     147
3            4       1  ...          2      55
4            5       3  ...          2     147

[5 rows x 14 columns]

**Now Drop the unuseful Columns**

In [34]:
inputs_n = inputs.drop(['Name','Sex','Ticket', 'Cabin','Embarked','Cabin_n','Embarked_n'],axis='columns')
inputs_n.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare  Sex_n
0            1       3  22.0      1      0   7.2500      1
1            2       1  38.0      1      0  71.2833      0
2            3       3  26.0      0      0   7.9250      0
3            4       1  35.0      1      0  53.1000      0
4            5       3  35.0      0      0   8.0500      1

In [35]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

**Float to Integer**

In [36]:
import math
import numpy as np

inputs_n['Fare']  = df['Fare'].apply(np.ceil)
#inputs_n['Cabin_n']  = df['Cabin_n'].apply(np.ceil)
#inputs_n['Embarked_n']  = df['Embarked_n'].apply(np.ceil)
inputs_n.head()

   PassengerId  Pclass   Age  SibSp  Parch  Fare  Sex_n
0            1       3  22.0      1      0   8.0      1
1            2       1  38.0      1      0  72.0      0
2            3       3  26.0      0      0   8.0      0
3            4       1  35.0      1      0  54.0      0
4            5       3  35.0      0      0   9.0      1

**To handle Error of** ValueError: Input contains NaN, infinity or a value too large for dtype('float32'). **I used the function Fillna, That Fill NAN Values and Infinite Values Zero**

In [50]:
inputs_n = inputs_n.fillna(inputs_n.mean())
inputs_n.head()

   PassengerId  Pclass   Age  SibSp  Parch  Fare  Sex_n
0            1       3  22.0      1      0   8.0      1
1            2       1  38.0      1      0  72.0      0
2            3       3  26.0      0      0   8.0      0
3            4       1  35.0      1      0  54.0      0
4            5       3  35.0      0      0   9.0      1

**Import the Decision Tree from Sklearn**

In [44]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [45]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [46]:
model.score(inputs_n,target)

1.0

**Testing**

In [51]:
model.predict([[4,1,35,1,0,54,0]])

/usr/local/lib/python3.7/dist-packages/sklearn/base.py:446: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  "X does not have valid feature names, but"

array([1])

In [52]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64